

MariaDB [(none)]> show databases;
+--------------------+
| Database           |
+--------------------+
| db_lesson          |
| information_schema |
| mysql              |
| performance_schema |
| phpmyadmin         |
| test               |
+--------------------+
6 rows in set (0.001 sec)

MariaDB [(none)]> use db_lesson;
Database changed
MariaDB [db_lesson]> show tables;
+---------------------+
| Tables_in_db_lesson |
+---------------------+
| people              |
| reports             |
+---------------------+
2 rows in set (0.001 sec)



-- Q1------------------------------------------------------------------------------------------------
-- departmentsテーブルの追加

MariaDB [db_lesson]> create table departments (
    -> department_id int unsigned auto_increment primary key,
    -> name varchar(20) not null,
    -> created_at timestamp null default current_timestamp,
    -> updated_at timestamp null default current_timestamp on update current_timestamp
    -> );
Query OK, 0 rows affected (0.031 sec)

MariaDB [db_lesson]> desc departments;
+---------------+------------------+------+-----+---------------------+-------------------------------+
| Field         | Type             | Null | Key | Default             | Extra                         |
+---------------+------------------+------+-----+---------------------+-------------------------------+
| department_id | int(10) unsigned | NO   | PRI | NULL                | auto_increment                |
| name          | varchar(20)      | NO   |     | NULL                |                               |
| created_at    | timestamp        | YES  |     | current_timestamp() |                               |
| updated_at    | timestamp        | YES  |     | current_timestamp() | on update current_timestamp() |
+---------------+------------------+------+-----+---------------------+-------------------------------+
4 rows in set (0.035 sec)


-- ------------------------------------------------------------------------------------------------


MariaDB [db_lesson]> show tables;
+---------------------+
| Tables_in_db_lesson |
+---------------------+
| departments         |
| people              |
| reports             |
+---------------------+
3 rows in set (0.001 sec)

MariaDB [db_lesson]>




-- Q2-------------------------------------------------------------------------------------------
-- department_idをpeopleテーブルに追加


MariaDB [db_lesson]> alter table people add department_id int unsigned null after email;
Query OK, 0 rows affected (0.011 sec)
Records: 0  Duplicates: 0  Warnings: 0

MariaDB [db_lesson]> desc people;
+---------------+---------------------+------+-----+---------------------+-------------------------------+
| Field         | Type                | Null | Key | Default             | Extra                         |
+---------------+---------------------+------+-----+---------------------+-------------------------------+
| person_id     | int(10) unsigned    | NO   | PRI | NULL                | auto_increment                |
| name          | varchar(20)         | NO   |     | NULL                |                               |
| email         | varchar(255)        | YES  | UNI | NULL                |                               |
| department_id | int(10) unsigned    | YES  |     | NULL                |                               |
| age           | tinyint(3) unsigned | YES  |     | NULL                |                               |
| gender        | tinyint(4)          | YES  |     | NULL                |                               |
| created_at    | timestamp           | NO   |     | current_timestamp() |                               |
| updated_at    | timestamp           | NO   |     | current_timestamp() | on update current_timestamp() |
+---------------+---------------------+------+-----+---------------------+-------------------------------+
8 rows in set (0.052 sec)

MariaDB [db_lesson]>





-- Q3------------------------------------------------------------------------------------------------

-- departmentsにレコードを挿入

MariaDB [db_lesson]> insert into departments (name)
    -> values
    -> ('営業'),
    -> ('開発'),
    -> ('経理'),
    -> ('人事'),
    -> ('情報システム');
Query OK, 5 rows affected (0.023 sec)
Records: 5  Duplicates: 0  Warnings: 0

MariaDB [db_lesson]> select * from departments;
+---------------+--------------+---------------------+---------------------+
| department_id | name         | created_at          | updated_at          |
+---------------+--------------+---------------------+---------------------+
|             1 | 営業         | 2025-10-04 10:06:48 | 2025-10-04 10:06:48 |
|             2 | 開発         | 2025-10-04 10:06:48 | 2025-10-04 10:06:48 |
|             3 | 経理         | 2025-10-04 10:06:48 | 2025-10-04 10:06:48 |
|             4 | 人事         | 2025-10-04 10:06:48 | 2025-10-04 10:06:48 |
|             5 | 情報システム | 2025-10-04 10:06:48 | 2025-10-04 10:06:48 |
+---------------+--------------+---------------------+---------------------+
5 rows in set (0.001 sec)



-- peopleにレコードを挿入

MariaDB [db_lesson]> select * from people;
+-----------+----------------+---------------------+---------------+------+--------+---------------------+---------------------+
| person_id | name           | email               | department_id | age  | gender | created_at          | updated_at          |
+-----------+----------------+---------------------+---------------+------+--------+---------------------+---------------------+
|         1 | 鈴木たかし     | suzuki@gizumo.jp    |          NULL |   20 |      1 | 2025-10-04 09:06:04 | 2025-10-04 09:06:04 |
|         2 | 田中ゆうこ     | tanaka@gizumo.jp    |          NULL |   25 |      2 | 2025-10-04 09:06:04 | 2025-10-04 09:06:04 |
|         3 | 福田だいすけ   | fukuda@gizumo.jp    |          NULL |   42 |      1 | 2025-10-04 09:06:04 | 2025-10-04 09:06:04 |
|         4 | 豊島はなこ     | toyoshima@gizumo.jp |          NULL |   34 |      2 | 2025-10-04 09:06:04 | 2025-10-04 09:06:04 |
|         5 | 不思議沢みちこ | NULL                |          NULL | NULL |   NULL | 2025-10-04 09:06:04 | 2025-10-04 09:06:04 |
|         7 | 高橋ゆうき     | takahashi@gizumo.jp |          NULL |   25 |      1 | 2025-10-04 09:06:04 | 2025-10-04 09:06:04 |
+-----------+----------------+---------------------+---------------+------+--------+---------------------+---------------------+
6 rows in set (0.001 sec)

MariaDB [db_lesson]> insert into people (name, email, department_id, age, gender)
    -> values
    -> ('工藤まさき', 'kudou@gizumo.jp', 1, 34, 1),
    -> ('浅川ゆり', 'asakawa@gizumo.jp', 2, 26, 2),
    -> ('麻生まき', 'asou@gizumo.jp', 3, 47, 2),
    -> ('斎藤ゆうき', 'saitou@gizumo.jp', 4, 38, 1),
    -> ('井上だいすけ', 'inoue@gizumo.jp', 5, 27, 1),
    -> ('月島あいか', 'tsukishima@gizumo.jp', 1, 23, 2),
    -> ('村上さとる', 'murakami@gizumo.jp', 2, 53, 1),
    -> ('羽村みずき', 'hamura@gizumo.jp', 1, 30, 2),
    -> ('奥村あき', 'okumura@gizumo.jp', 2, 25, 1),
    -> ('黒川みどり', 'kurokawa@gizumo.jp', 2, 36, 2);
Query OK, 10 rows affected (0.022 sec)
Records: 10  Duplicates: 0  Warnings: 0

MariaDB [db_lesson]> select * from people;
+-----------+----------------+----------------------+---------------+------+--------+---------------------+---------------------+
| person_id | name           | email                | department_id | age  | gender | created_at          | updated_at          |
+-----------+----------------+----------------------+---------------+------+--------+---------------------+---------------------+
|         1 | 鈴木たかし     | suzuki@gizumo.jp     |          NULL |   20 |      1 | 2025-10-04 09:06:04 | 2025-10-04 09:06:04 |
|         2 | 田中ゆうこ     | tanaka@gizumo.jp     |          NULL |   25 |      2 | 2025-10-04 09:06:04 | 2025-10-04 09:06:04 |
|         3 | 福田だいすけ   | fukuda@gizumo.jp     |          NULL |   42 |      1 | 2025-10-04 09:06:04 | 2025-10-04 09:06:04 |
|         4 | 豊島はなこ     | toyoshima@gizumo.jp  |          NULL |   34 |      2 | 2025-10-04 09:06:04 | 2025-10-04 09:06:04 |
|         5 | 不思議沢みちこ | NULL                 |          NULL | NULL |   NULL | 2025-10-04 09:06:04 | 2025-10-04 09:06:04 |
|         7 | 高橋ゆうき     | takahashi@gizumo.jp  |          NULL |   25 |      1 | 2025-10-04 09:06:04 | 2025-10-04 09:06:04 |
|         8 | 工藤まさき     | kudou@gizumo.jp      |             1 |   34 |      1 | 2025-10-04 10:14:55 | 2025-10-04 10:14:55 |
|         9 | 浅川ゆり       | asakawa@gizumo.jp    |             2 |   26 |      2 | 2025-10-04 10:14:55 | 2025-10-04 10:14:55 |
|        10 | 麻生まき       | asou@gizumo.jp       |             3 |   47 |      2 | 2025-10-04 10:14:55 | 2025-10-04 10:14:55 |
|        11 | 斎藤ゆうき     | saitou@gizumo.jp     |             4 |   38 |      1 | 2025-10-04 10:14:55 | 2025-10-04 10:14:55 |
|        12 | 井上だいすけ   | inoue@gizumo.jp      |             5 |   27 |      1 | 2025-10-04 10:14:55 | 2025-10-04 10:14:55 |
|        13 | 月島あいか     | tsukishima@gizumo.jp |             1 |   23 |      2 | 2025-10-04 10:14:55 | 2025-10-04 10:14:55 |
|        14 | 村上さとる     | murakami@gizumo.jp   |             2 |   53 |      1 | 2025-10-04 10:14:55 | 2025-10-04 10:14:55 |
|        15 | 羽村みずき     | hamura@gizumo.jp     |             1 |   30 |      2 | 2025-10-04 10:14:55 | 2025-10-04 10:14:55 |
|        16 | 奥村あき       | okumura@gizumo.jp    |             2 |   25 |      1 | 2025-10-04 10:14:55 | 2025-10-04 10:14:55 |
|        17 | 黒川みどり     | kurokawa@gizumo.jp   |             2 |   36 |      2 | 2025-10-04 10:14:55 | 2025-10-04 10:14:55 |
+-----------+----------------+----------------------+---------------+------+--------+---------------------+---------------------+
16 rows in set (0.001 sec)



-- reportsにレコードを挿入

MariaDB [db_lesson]> insert into reports (person_id, content)
    -> value
    -> (8, '工藤です。今日はお寿司を食べに行きます。'),
    -> (9, 'こんにちは、今日もいいお天気ですね。浅川'),
    -> (10, '麻生です。私の好きな食べ物はハンバーグです。'),
    -> (11, '昨日は何をして過ごしましたか。斎藤'),
    -> (12, '今度テーマパークに遊びに行く予定があります。井上'),
    -> (13, '一緒にお昼ご飯食べに行きませんか。月島'),
    -> (4, '豊島です。風邪を引いてしまってお休みします。'),
    -> (2, '最近編み物にはまっています。田中'),
    -> (1, '鈴木です。今回の連休で北海道に旅行してきました。'),
    -> (2, '最近寒くなってきましたね。田中');
Query OK, 10 rows affected (0.006 sec)
Records: 10  Duplicates: 0  Warnings: 0

MariaDB [db_lesson]> select * from reports;
+-----------+-----------+--------------------------------------------------+---------------------+---------------------+
| report_id | person_id | content                                          | created_at          | updated_at          |
+-----------+-----------+--------------------------------------------------+---------------------+---------------------+
|         1 |         1 | こんにちは鈴木です。                             | 2025-09-29 21:26:20 | 2025-09-29 21:26:20 |
|         2 |         2 | 田中です。お元気ですか。                         | 2025-09-29 21:26:20 | 2025-09-29 21:26:20 |
|         3 |         1 | いいお天気ですね鈴木                             | 2025-09-29 21:26:20 | 2025-09-29 21:26:20 |
|         4 |         3 | 福田です。今日は何を食べましたか                 | 2025-09-29 21:28:14 | 2025-09-29 21:28:14 |
|         5 |         4 | 良い日になるといいですね。豊島                   | 2025-09-29 21:29:55 | 2025-09-29 21:29:55 |
|         6 |         7 | 初めまして。高橋です。                           | 2025-09-29 21:29:55 | 2025-09-29 21:29:55 |
|         7 |         3 | 夜ご飯はハンバーグがいいなあ。福田               | 2025-09-29 21:34:10 | 2025-09-29 21:34:10 |
|         8 |         4 | 引っ越しました。豊島                             | 2025-09-29 21:34:10 | 2025-09-29 21:34:10 |
|         9 |         7 | 飲み物はやっぱり水が一番です。高橋               | 2025-09-29 21:34:10 | 2025-09-29 21:34:10 |
|        10 |         7 | 好きなものは肉じゃがです。高橋                   | 2025-09-29 21:34:10 | 2025-09-29 21:34:10 |
|        11 |         8 | 工藤です。今日は何をしようかな。                 | 2025-09-29 21:34:10 | 2025-10-04 10:24:47 |
|        12 |         4 | 久々の運動きもちいいな。豊島                     | 2025-09-29 21:34:10 | 2025-09-29 21:34:10 |
|        13 |         8 | 工藤です。今日はお寿司を食べに行きます。         | 2025-10-03 22:45:42 | 2025-10-04 10:25:45 |
|        14 |         9 | こんにちは、今日もいいお天気ですね。浅川         | 2025-10-03 22:45:42 | 2025-10-03 22:45:42 |
|        15 |        10 | 麻生です。私の好きな食べ物はハンバーグです。     | 2025-10-03 22:45:42 | 2025-10-03 22:45:42 |
|        16 |        11 | 昨日は何をして過ごしましたか。斎藤               | 2025-10-03 22:45:42 | 2025-10-03 22:45:42 |
|        17 |        12 | 今度テーマパークに遊びに行く予定があります。井上 | 2025-10-03 22:45:42 | 2025-10-03 22:45:42 |
|        18 |        13 | 一緒にお昼ご飯食べに行きませんか。月島           | 2025-10-03 22:45:42 | 2025-10-03 22:45:42 |
|        19 |         4 | 豊島です。風邪を引いてしまってお休みします。     | 2025-10-03 22:45:42 | 2025-10-03 22:45:42 |
|        20 |         2 | 最近編み物にはまっています。田中                 | 2025-10-03 22:45:42 | 2025-10-03 22:45:42 |
|        21 |         1 | 鈴木です。今回の連休で北海道に旅行してきました。 | 2025-10-03 22:45:42 | 2025-10-03 22:45:42 |
|        22 |         2 | 最近寒くなってきましたね。田中                   | 2025-10-03 22:45:42 | 2025-10-03 22:45:42 |
+-----------+-----------+--------------------------------------------------+---------------------+---------------------+
22 rows in set (0.000 sec)








-- Q4------------------------------------------------------------------------------------------------
-- peopleテーブルのnullに部署を割り振る

MariaDB [db_lesson]> select * from people;
+-----------+----------------+----------------------+---------------+------+--------+---------------------+---------------------+
| person_id | name           | email                | department_id | age  | gender | created_at          | updated_at          |
+-----------+----------------+----------------------+---------------+------+--------+---------------------+---------------------+
|         1 | 鈴木たかし     | suzuki@gizumo.jp     |          NULL |   20 |      1 | 2025-10-04 09:06:04 | 2025-10-04 09:06:04 |
|         2 | 田中ゆうこ     | tanaka@gizumo.jp     |          NULL |   25 |      2 | 2025-10-04 09:06:04 | 2025-10-04 09:06:04 |
|         3 | 福田だいすけ   | fukuda@gizumo.jp     |          NULL |   42 |      1 | 2025-10-04 09:06:04 | 2025-10-04 09:06:04 |
|         4 | 豊島はなこ     | toyoshima@gizumo.jp  |          NULL |   34 |      2 | 2025-10-04 09:06:04 | 2025-10-04 09:06:04 |
|         5 | 不思議沢みちこ | NULL                 |          NULL | NULL |   NULL | 2025-10-04 09:06:04 | 2025-10-04 09:06:04 |
|         7 | 高橋ゆうき     | takahashi@gizumo.jp  |          NULL |   25 |      1 | 2025-10-04 09:06:04 | 2025-10-04 09:06:04 |
|         8 | 工藤まさき     | kudou@gizumo.jp      |             1 |   34 |      1 | 2025-10-04 10:14:55 | 2025-10-04 10:14:55 |
|         9 | 浅川ゆり       | asakawa@gizumo.jp    |             2 |   26 |      2 | 2025-10-04 10:14:55 | 2025-10-04 10:14:55 |
|        10 | 麻生まき       | asou@gizumo.jp       |             3 |   47 |      2 | 2025-10-04 10:14:55 | 2025-10-04 10:14:55 |
|        11 | 斎藤ゆうき     | saitou@gizumo.jp     |             4 |   38 |      1 | 2025-10-04 10:14:55 | 2025-10-04 10:14:55 |
|        12 | 井上だいすけ   | inoue@gizumo.jp      |             5 |   27 |      1 | 2025-10-04 10:14:55 | 2025-10-04 10:14:55 |
|        13 | 月島あいか     | tsukishima@gizumo.jp |             1 |   23 |      2 | 2025-10-04 10:14:55 | 2025-10-04 10:14:55 |
|        14 | 村上さとる     | murakami@gizumo.jp   |             2 |   53 |      1 | 2025-10-04 10:14:55 | 2025-10-04 10:14:55 |
|        15 | 羽村みずき     | hamura@gizumo.jp     |             1 |   30 |      2 | 2025-10-04 10:14:55 | 2025-10-04 10:14:55 |
|        16 | 奥村あき       | okumura@gizumo.jp    |             2 |   25 |      1 | 2025-10-04 10:14:55 | 2025-10-04 10:14:55 |
|        17 | 黒川みどり     | kurokawa@gizumo.jp   |             2 |   36 |      2 | 2025-10-04 10:14:55 | 2025-10-04 10:14:55 |
+-----------+----------------+----------------------+---------------+------+--------+---------------------+---------------------+
16 rows in set (0.001 sec)

MariaDB [db_lesson]> update people set department_id = 1 where person_id = 1;
Query OK, 1 row affected (0.021 sec)
Rows matched: 1  Changed: 1  Warnings: 0

MariaDB [db_lesson]> update people set department_id = 2 where person_id = 2;
Query OK, 1 row affected (0.022 sec)
Rows matched: 1  Changed: 1  Warnings: 0

MariaDB [db_lesson]> update people set department_id = 5 where person_id = 3;
Query OK, 1 row affected (0.022 sec)
Rows matched: 1  Changed: 1  Warnings: 0

MariaDB [db_lesson]> update people set department_id = 2 where person_id = 4;
Query OK, 1 row affected (0.021 sec)
Rows matched: 1  Changed: 1  Warnings: 0

MariaDB [db_lesson]> update people set department_id = 4 where person_id = 5;
Query OK, 1 row affected (0.023 sec)
Rows matched: 1  Changed: 1  Warnings: 0

MariaDB [db_lesson]> update people set department_id = 1 where person_id = 7;
Query OK, 1 row affected (0.023 sec)
Rows matched: 1  Changed: 1  Warnings: 0

MariaDB [db_lesson]> select * from people;
+-----------+----------------+----------------------+---------------+------+--------+---------------------+---------------------+
| person_id | name           | email                | department_id | age  | gender | created_at          | updated_at          |
+-----------+----------------+----------------------+---------------+------+--------+---------------------+---------------------+
|         1 | 鈴木たかし     | suzuki@gizumo.jp     |             1 |   20 |      1 | 2025-10-04 09:06:04 | 2025-10-04 10:32:59 |
|         2 | 田中ゆうこ     | tanaka@gizumo.jp     |             2 |   25 |      2 | 2025-10-04 09:06:04 | 2025-10-04 10:33:08 |
|         3 | 福田だいすけ   | fukuda@gizumo.jp     |             5 |   42 |      1 | 2025-10-04 09:06:04 | 2025-10-04 10:33:24 |
|         4 | 豊島はなこ     | toyoshima@gizumo.jp  |             2 |   34 |      2 | 2025-10-04 09:06:04 | 2025-10-04 10:33:31 |
|         5 | 不思議沢みちこ | NULL                 |             4 | NULL |   NULL | 2025-10-04 09:06:04 | 2025-10-04 10:33:41 |
|         7 | 高橋ゆうき     | takahashi@gizumo.jp  |             1 |   25 |      1 | 2025-10-04 09:06:04 | 2025-10-04 10:34:13 |
|         8 | 工藤まさき     | kudou@gizumo.jp      |             1 |   34 |      1 | 2025-10-04 10:14:55 | 2025-10-04 10:14:55 |
|         9 | 浅川ゆり       | asakawa@gizumo.jp    |             2 |   26 |      2 | 2025-10-04 10:14:55 | 2025-10-04 10:14:55 |
|        10 | 麻生まき       | asou@gizumo.jp       |             3 |   47 |      2 | 2025-10-04 10:14:55 | 2025-10-04 10:14:55 |
|        11 | 斎藤ゆうき     | saitou@gizumo.jp     |             4 |   38 |      1 | 2025-10-04 10:14:55 | 2025-10-04 10:14:55 |
|        12 | 井上だいすけ   | inoue@gizumo.jp      |             5 |   27 |      1 | 2025-10-04 10:14:55 | 2025-10-04 10:14:55 |
|        13 | 月島あいか     | tsukishima@gizumo.jp |             1 |   23 |      2 | 2025-10-04 10:14:55 | 2025-10-04 10:14:55 |
|        14 | 村上さとる     | murakami@gizumo.jp   |             2 |   53 |      1 | 2025-10-04 10:14:55 | 2025-10-04 10:14:55 |
|        15 | 羽村みずき     | hamura@gizumo.jp     |             1 |   30 |      2 | 2025-10-04 10:14:55 | 2025-10-04 10:14:55 |
|        16 | 奥村あき       | okumura@gizumo.jp    |             2 |   25 |      1 | 2025-10-04 10:14:55 | 2025-10-04 10:14:55 |
|        17 | 黒川みどり     | kurokawa@gizumo.jp   |             2 |   36 |      2 | 2025-10-04 10:14:55 | 2025-10-04 10:14:55 |
+-----------+----------------+----------------------+---------------+------+--------+---------------------+---------------------+
16 rows in set (0.000 sec)









-- Q5------------------------------------------------------------------------------------------------
-- 年齢の降順で男性の名前と年齢を取得

MariaDB [db_lesson]> select name, age from people where gender = 1 order by age desc;
+--------------+------+
| name         | age  |
+--------------+------+
| 村上さとる   |   53 |
| 福田だいすけ |   42 |
| 斎藤ゆうき   |   38 |
| 工藤まさき   |   34 |
| 井上だいすけ |   27 |
| 高橋ゆうき   |   25 |
| 奥村あき     |   25 |
| 鈴木たかし   |   20 |
+--------------+------+
8 rows in set (0.002 sec)







-- Q6------------------------------------------------------------------------------------------------
-- テーブル・レコード・カラムという3つの単語を適切に使用して、下記のSQL文を日本語で説明

SELECT `name`, `email`, `age` FROM `people` WHERE `department_id` = 1 ORDER BY `created_at`;

`people`テーブルから、`department_id`が1のレコードにおいて`name`, `email`, `age`の三つのカラムを取得する。またそれらは`created_at`というレコードを昇順に並べたときの順番で並べる。




-- Q7------------------------------------------------------------------------------------------------
-- 20代の女性と40代の男性の名前一覧を取得

MariaDB [db_lesson]> select name from people where age between 20 and 29 and gender = 2 or age between 40 and 49 and gender = 1;
+--------------+
| name         |
+--------------+
| 田中ゆうこ   |
| 福田だいすけ |
| 浅川ゆり     |
| 月島あいか   |
+--------------+
4 rows in set (0.001 sec)





-- Q8------------------------------------------------------------------------------------------------
-- 営業部に所属する人だけを年齢の昇順で取得

MariaDB [db_lesson]> select name, age from people where department_id = 1 order by age asc;
+------------+------+
| name       | age  |
+------------+------+
| 鈴木たかし |   20 |
| 月島あいか |   23 |
| 高橋ゆうき |   25 |
| 羽村みずき |   30 |
| 工藤まさき |   34 |
+------------+------+
5 rows in set (0.000 sec)

MariaDB [db_lesson]>






-- Q9------------------------------------------------------------------------------------------------
-- 開発部に所属している女性の平均年齢を取得

MariaDB [db_lesson]> select avg(age) as average_age from people where gender = 2 and department_id = 2 group by gender;
+-------------+
| average_age |
+-------------+
|     30.2500 |
+-------------+
1 row in set (0.001 sec)







-- Q10------------------------------------------------------------------------------------------------
-- 名前と部署名とその人が提出した日報の内容を同時に取得

MariaDB [db_lesson]> select p.name, d.name, r.content
    -> from people p inner join departments d on d.department_id = p.department_id join reports r on p.person_id = r.person_id;
+--------------+--------------+--------------------------------------------------+
| name         | name         | content                                          |
+--------------+--------------+--------------------------------------------------+
| 鈴木たかし   | 営業         | こんにちは鈴木です。                             |
| 鈴木たかし   | 営業         | いいお天気ですね鈴木                             |
| 高橋ゆうき   | 営業         | 初めまして。高橋です。                           |
| 高橋ゆうき   | 営業         | 飲み物はやっぱり水が一番です。高橋               |
| 高橋ゆうき   | 営業         | 好きなものは肉じゃがです。高橋                   |
| 工藤まさき   | 営業         | 工藤です。今日は何をしようかな。                 |
| 工藤まさき   | 営業         | 工藤です。今日はお寿司を食べに行きます。         |
| 月島あいか   | 営業         | 一緒にお昼ご飯食べに行きませんか。月島           |
| 鈴木たかし   | 営業         | 鈴木です。今回の連休で北海道に旅行してきました。 |
| 田中ゆうこ   | 開発         | 田中です。お元気ですか。                         |
| 豊島はなこ   | 開発         | 良い日になるといいですね。豊島                   |
| 豊島はなこ   | 開発         | 引っ越しました。豊島                             |
| 豊島はなこ   | 開発         | 久々の運動きもちいいな。豊島                     |
| 浅川ゆり     | 開発         | こんにちは、今日もいいお天気ですね。浅川         |
| 豊島はなこ   | 開発         | 豊島です。風邪を引いてしまってお休みします。     |
| 田中ゆうこ   | 開発         | 最近編み物にはまっています。田中                 |
| 田中ゆうこ   | 開発         | 最近寒くなってきましたね。田中                   |
| 麻生まき     | 経理         | 麻生です。私の好きな食べ物はハンバーグです。     |
| 斎藤ゆうき   | 人事         | 昨日は何をして過ごしましたか。斎藤               |
| 福田だいすけ | 情報システム | 福田です。今日は何を食べましたか                 |
| 福田だいすけ | 情報システム | 夜ご飯はハンバーグがいいなあ。福田               |
| 井上だいすけ | 情報システム | 今度テーマパークに遊びに行く予定があります。井上 |
+--------------+--------------+--------------------------------------------------+
22 rows in set (0.003 sec)






-- Q11------------------------------------------------------------------------------------------------
-- 日報を一つも提出していない人の名前一覧を取得

MariaDB [db_lesson]> select p.name, r.content
    -> from people p left outer join reports r using (person_id) where r.content is null;
+----------------+---------+
| name           | content |
+----------------+---------+
| 不思議沢みちこ | NULL    |
| 村上さとる     | NULL    |
| 羽村みずき     | NULL    |
| 奥村あき       | NULL    |
| 黒川みどり     | NULL    |
+----------------+---------+
5 rows in set (0.001 sec)







